# Import libraries

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

# Import data

In [2]:
path=r'/Users/tejas/Documents/CareerFoundry_DataAnalytics/Data Immersion/A4/Instacart Basket Analysis'

In [3]:
# import customers.csv data set
df_customers=pd.read_csv(os.path.join(path,'02 Data','Original Data','customers.csv'), index_col=False)

In [4]:
# check the output
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# check the total size
df_customers.shape

(206209, 10)

## Data wrangling

In [6]:
# drop irrelevant columns
df_customers=df_customers.drop(columns=['First Name', 'Surnam', 'date_joined'])

In [7]:
# check the output
df_customers.head()

   user_id  Gender       STATE  Age  n_dependants fam_status  income
0    26711  Female    Missouri   48             3    married  165665
1    33890  Female  New Mexico   36             0     single   59285
2    65803    Male       Idaho   35             2    married   99568
3   125935  Female        Iowa   40             0     single   42049
4   130797  Female    Maryland   26             1    married   40374

In [8]:
# rename columns
df_customers.rename(columns={'Gender':'gender', 'STATE': 'state', 'Age': 'age', 'fam_status': 'family_status'}, inplace=True)

In [9]:
# check the output
df_customers.head()

   user_id  gender       state  age  n_dependants family_status  income
0    26711  Female    Missouri   48             3       married  165665
1    33890  Female  New Mexico   36             0        single   59285
2    65803    Male       Idaho   35             2       married   99568
3   125935  Female        Iowa   40             0        single   42049
4   130797  Female    Maryland   26             1       married   40374

In [10]:
# check the data type of user_id
df_customers['user_id'].dtype

dtype('int64')

In [11]:
# change the data type of user_id
df_customers['user_id']=df_customers['user_id'].astype('str')

In [12]:
# check the output
df_customers['user_id'].dtype

dtype('O')

## Data consistency checks

In [13]:
# check descriptive statistics
df_customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [14]:
# check for mixed-type data
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

#### There are no mixed-type data

In [15]:
# check for missing values
df_customers.isnull().sum()

user_id          0
gender           0
state            0
age              0
n_dependants     0
family_status    0
income           0
dtype: int64

#### There are no missing values

In [16]:
# check for duplicates
df_customers[df_customers.duplicated()]

Empty DataFrame
Columns: [user_id, gender, state, age, n_dependants, family_status, income]
Index: []

#### There are no duplicates

## Export the newly cleaned and formatted customers dataframe

In [17]:
# export df_customers to csv
df_customers.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'customers_wrangled_and_checked.csv'))

# Merge customers data with orders_products_merged data

In [21]:
# import orders_products_merged.pkl data set to combine with df_customers
df_ords_prods_merged=pd.read_pickle(os.path.join(path,'02 Data','Prepared Data','orders_products_merged_new.pkl'))

In [22]:
# check the output
df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,_merge,price_label,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spending,spending_flag,order_frequency,order_frequency_flag
0,3139998,138,28,6,11,3.0,False,1,5,0,...,both,Mid-range product,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1977647,138,30,6,17,20.0,False,1,1,1,...,both,Mid-range product,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,389851,709,2,0,21,6.0,False,1,20,0,...,both,Mid-range product,Most busy,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,652770,764,1,3,13,NaN,True,1,10,0,...,both,Mid-range product,Least busy,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1813452,764,3,4,17,9.0,False,1,11,1,...,both,Mid-range product,Least busy,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [23]:
# check the total size
df_ords_prods_merged.shape

(32404859, 24)

In [25]:
# check the data type of key column in df_ords_prods_merged
df_ords_prods_merged['user_id'].dtype

dtype('int64')

In [26]:
# change the data type of user_id
df_ords_prods_merged['user_id']=df_ords_prods_merged['user_id'].astype('str')

In [28]:
# check the output
df_ords_prods_merged['user_id'].dtype

dtype('O')

In [31]:
# drop previously existing _merge column from df_ords_prods_merged
df_ords_prods_merged=df_ords_prods_merged.drop(columns=['_merge'])

In [32]:
# check the columns
df_ords_prods_merged.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'first_order',
       'product_id', 'add_to_cart_order', 'reordered', 'product_name',
       'aisle_id', 'department_id', 'prices', 'price_label', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'avg_spending',
       'spending_flag', 'order_frequency', 'order_frequency_flag'],
      dtype='object')

In [33]:
# merge df_customers and df_ords_prods_merged using user_id as key, add a merge flag
df_ords_prods_cust=df_customers.merge(df_ords_prods_merged, on='user_id', indicator=True)

In [35]:
# check the output
df_ords_prods_cust.head()

,user_id,gender,state,age,n_dependants,family_status,income,order_id,order_number,orders_day_of_week,...,price_label,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spending,spending_flag,order_frequency,order_frequency_flag,_merge
0,26711,Female,Missouri,48,3,married,165665,2543867,5,1,...,Mid-range product,Most busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Female,Missouri,48,3,married,165665,1285508,7,5,...,Mid-range product,Regularly busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Female,Missouri,48,3,married,165665,2578584,8,1,...,Mid-range product,Most busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Female,Missouri,48,3,married,165665,518967,1,2,...,Low-range product,Regularly busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Female,Missouri,48,3,married,165665,2524893,3,3,...,Low-range product,Least busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [36]:
# check the total size
df_ords_prods_cust.shape

(32404859, 30)

In [37]:
# check the frequency of _merge
df_ords_prods_cust['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [38]:
# drop the _merge flag after confirming it is a full match
df_ords_prods_cust=df_ords_prods_cust.drop(columns=['_merge'])

In [39]:
# check the columns
df_ords_prods_cust.columns

Index(['user_id', 'gender', 'state', 'age', 'n_dependants', 'family_status',
       'income', 'order_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'first_order',
       'product_id', 'add_to_cart_order', 'reordered', 'product_name',
       'aisle_id', 'department_id', 'prices', 'price_label', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'avg_spending',
       'spending_flag', 'order_frequency', 'order_frequency_flag'],
      dtype='object')

In [40]:
# check df_ords_prods_cust
df_ords_prods_cust.head()

,user_id,gender,state,age,n_dependants,family_status,income,order_id,order_number,orders_day_of_week,...,prices,price_label,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spending,spending_flag,order_frequency,order_frequency_flag
0,26711,Female,Missouri,48,3,married,165665,2543867,5,1,...,9.0,Mid-range product,Most busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer
1,26711,Female,Missouri,48,3,married,165665,1285508,7,5,...,9.0,Mid-range product,Regularly busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
2,26711,Female,Missouri,48,3,married,165665,2578584,8,1,...,9.0,Mid-range product,Most busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
3,26711,Female,Missouri,48,3,married,165665,518967,1,2,...,4.3,Low-range product,Regularly busy,Average orders,8,New customer,7.988889,Low spender,19.0,Regular customer
4,26711,Female,Missouri,48,3,married,165665,2524893,3,3,...,4.3,Low-range product,Least busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer

In [41]:
# export df_ords_prods_cust to pkl
df_ords_prods_cust.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers.pkl'))